# RebarShapeDefinesHooks Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReinforcementSettings..::..RebarShapeDefinesHooks Property
ReinforcementSettings Class See Also
---
Hooks are defined by Rebar Shape of Rebar element. Can be changed if document contains no rebars, area reinforcements and path reinforcements.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool RebarShapeDefinesHooks { get; set; }
```

Visual Basic
---
```text
Public Property RebarShapeDefinesHooks As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool RebarShapeDefinesHooks {
	bool get ();
	void set (bool value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: Cannot change the RebarShapeDefinesHooks property in these settings because the document contains one or more Rebar elements. -or- When setting this property: Cannot change the RebarShapeDefinesHooks property in these settings because the document contains one or more AreaReinforcement or PathReinforcement elements. -or- When setting this property: Cannot change the RebarShapeDefinesHooks property in these settings because the document contains one or more RebarContainer elements. the document contains one or more RebarContainer elements. |

# See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace